@echo off
chcp 65001
title Запуск книжного магазина
echo ========================================
echo 🔧 Установка зависимостей проекта...
echo ========================================
call npm install

echo.
echo ✅ Зависимости установлены!
echo ========================================
echo 🚀 Запуск сервера Node.js...
echo Логин\Пароль:
echo admin@store.com\admin
echo user@store.com\user
echo ========================================
call node app.js

echo.
echo 🛑 Сервер остановлен. Нажмите любую клавишу для выхода...
pause >nul